<!DOCTYPE html>
<html>
	<head>
           <link type="text/css" rel="stylesheet" href="stylesheet.css"/>
           <meta charset="UTF-8">
		<title>TP Final InfoVis ITBA 2014/1 - Huchan, Jorge Guillermo y Garc&iacute;a, Diego</title>
	</head>
	<body>

		<h1>TP Final InfoVis ITBA 2014/1 - Huchan, Jorge Guillermo y Garc&iacute;a, Diego<h1>
		
		<p>Visualizaci&oacute;n del dataset de b&uacute;squedas de <span><a target="_blank" href="http://mapa.buenosaires.gob.ar">http://mapa.buenosaires.gob.ar</a></span><p>
         
		<p>Nuestro objetivo es analizar el dataset utilizando los mejores gr&aacute;ficos posibles seg&uacute;n los datos a mostrar y utilizando herramientas variadas con el fin de mostrar su dominio. La idea es utilizar tanto herramientas gr&aacute;ficas como c&oacute;digo.</p>
		
		<h2>Dataset completo en un mapa con Tableau</h2>
		<p>-explicaci&oacute;n e implementaci&oacute;n-</p>
		
		<h2>Top 20, barrios m&aacute;s consultados:</h2>
		<p>Hecho en D3, con force layout. Tiene interacci&oacute;n con el mouse, mouseover y tooltip.</p>
		<p>El tama&ntilde;o del c&iacute;rculo muestra la cantidad de consultas acumuladas. Los barrios est&aacute;n ordenados de mayor a menor.</p>
		<iframe src="d3_circles_force.html" style="width: 100%; height: 600px"
        scrolling="no" marginwidth="0" marginheight="0" frameborder="0" vspace="0" hspace="0">
        </iframe>
		
		<h2>Cantidad de consultas promedio por d&iacute;as y horas:</h2>
		<p>Hecho en D3. Tiene interacci&oacute;n con el mouse, mouseover y tooltip. Se utiliz&oacute; una de las paletas de colores de Cynthia Brewer.</p>
		<p>Este HeatMap muestra en el eje vertical los d&iacute;as de la semana y en el horizontal las horas. Se marca en negrita los d&iacute;as y horarios laborales. Se calcul&oacute; primero el promedio de consultas recibidas de cada intersecci&oacute;n y se definieron 5 "buckets" con su respectiva escala de colores secuencial.</p>
		<iframe src="day_hour_heatmap.html" style="width: 100%; height: 480px"
        scrolling="no" marginwidth="0" marginheight="0" frameborder="0" vspace="0" hspace="0">
        </iframe>
		
		<h2>Cantidad de consultas acumuladas por barrio:</h2>
		<p>Hecho con Google Charts. Tiene interacci&oacute;n con el mouse, tooltip.</p>
		<p>Gr&aacute;fico de barras horizontales, mostrando todos los barrios del dataset y con la cantidad de referencia en forma num&eacute;rica.</p>
		<iframe src="google_barchart_barrios.html" style="width: 100%; height: 600px"
        scrolling="no" marginwidth="0" marginheight="0" frameborder="0" vspace="0" hspace="0">
        </iframe>
		
		<h2>Visalizaci&oacute;n real time de la llegada de consultas promedio por franja horaria en d&iacute;as de semana y fines de semana o feriados:</h2>
		<p>Hecho con Visual Sedimentation.</p>
		<p>Primero se calcul&oacute; el promedio y se aplicaron los resultados a la visualizaci&oacute;n.</p>
		<iframe src="vsed_weekday.html" style="width: 30%; height: 200px"
        scrolling="no" marginwidth="0" marginheight="0" frameborder="0" vspace="0" hspace="0">
        </iframe>
		<iframe src="vsed_weekend.html" style="width: 30%; height: 200px"
        scrolling="no" marginwidth="0" marginheight="0" frameborder="0" vspace="0" hspace="0">
        </iframe>
	</body>
</html>